Repository: VLSLV333/movie_bot
Catalog: bot/locales/*/LC_MESSAGES/messages.po
Languages: ru, uk

# welcome_message
source: Hi, I am Juli, your movie friend bot! 🎬 I can help you find, watch and download movies!
ru: Привет, я Юля, твой бот-друг для фильмов! 🎬 Я могу помочь найти, посмотреть и скачать фильмы!
uk: Привіт, я Юля, твій бот-друг в світі кіно! 🎬 Я можу допомогти знайти, переглянути та завантажити кіно!

# onboarding_welcome
source: Awesome! Only 2 questions
ru: Отлично! Всего 2 вопроса
uk: Чудово! Лише 2 питання

# onboarding_completed
source: ✅ Great! Your preferences have been saved.
ru: ✅ Отлично! Ваши настройки сохранены.
uk: ✅ Чудово! Ваші налаштування збережено.

# onboarding_skipped
source: ✅ Okay! You can always change your preferences later in the settings.
ru: ✅ Хорошо, Вы всегда можете изменить настройки позже в меню.
uk: ✅ Добре, Ви завжди можете змінити налаштування пізніше в меню.

# preferences_suggestion
source: 💡 Want to get a better experience? Answer 2 questions
ru: 💡 Хотите сделать бот удобным? Ответьте на 2 вопроса
uk: 💡 Бажаєте, щоб бот був зручним? Дайте відповідь на 2 питання

# custom_name_prompt
source: Please type and send me your preferred name:
ru: Пожалуйста, напишите и отправьте мне ваше предпочитаемое имя:
uk: Як до вас звертатися? Напишіть та надішліть мені, будь ласка:

# back_to_main_menu
source: 🏠 You're back at the main menu!
ru: 🏠 Вы вернулись в главное меню
uk: 🏠 Ви повернулися до головного меню

# find_movie_btn
source: 🎬 Find a movie
ru: 🎬 Найти фильм
uk: 🎬 Знайти кіно

# recommend_btn
source: 💯 We recommend
ru: 💯 Рекомендую
uk: 💯 Рекомендуємо

# download_btn
source: 📥 Download a movie
ru: 📥 Скачать
uk: 📥 Завантажити

# watch_history_btn
source: 🧩 Watch History
ru: 🧩 История
uk: 🧩 Історія

# favorites_btn
source: ⭐ Favorites
ru: ⭐ Избранное
uk: ⭐ Улюблені

# options_btn
source: ⚙️ Options
ru: ⚙️ Настройки
uk: ⚙️ Налаштування

# search_type_question
source: 🎯 How would you like to search for a movie?
ru: 🎯 Как будем искать фильм?
uk: 🎯 Як будемо шукати кіно?

# search_by_name_btn
source: 🔤 Search by Name
ru: 🔤 По названию
uk: 🔤 За назвою

# search_by_genre_btn
source: 🎭 Search by Genre
ru: 🎭 По жанру
uk: 🎭 За жанром

# search_by_actor_btn
source: 🧑‍🎤 Search by Actor
ru: 🧑‍🎤 По актеру
uk: 🧑‍🎤 За актором

# search_by_director_btn
source: 🎬 Search by Director
ru: 🎬 По режиссеру
uk: 🎬 За режисером

# back_btn
source: 🔙 Back
ru: 🔙 Назад
uk: 🔙 Назад

# custom_name_btn
source: ✏️ Custom name
ru: ✏️ Свой ник
uk: ✏️ Власний нік

# set_preferences_btn
source: ⚙️ Set Preferences
ru: ⚙️ Настроить
uk: ⚙️ Налаштувати

# maybe_later_btn
source: ❌ Maybe Later
ru: 🤔 Возможно позже
uk: 🤔 Можливо пізніше

# continue_btn
source: ▶️ Continue
ru: ▶️ Продолжить
uk: ▶️ Продовжити

# cancel_btn
source: ❌ Cancel
ru: ❌ Отменить
uk: ❌ Скасувати

source: 🚀 Coming soon!
ru: 🚀 Скоро появится!
uk: 🚀 Скоро з'явиться!

# feature_unavailable
source: ⚠️ This feature is not available yet.
ru: ⚠️ Эта функция пока недоступна.
uk: ⚠️ Ця функція поки недоступна.

source: ⏳ Processing...
ru: ⏳ Обработка...
uk: ⏳ Обробка...

source: ⏳ Please wait...
ru: ⏳ Пожалуйста, подождите...
uk: ⏳ Будь ласка, зачекайте...

source: ✅ Success!
ru: ✅ Успех!
uk: ✅ Успіх!

# error_occurred
source: ❌ An error occurred.
ru: 😭 Произошла ошибка.
uk: 😭 Виникла помилка.

# lang_english
source: 🇺🇸 English
ru: 🇺🇸 Английский
uk: 🇺🇸 Англійська

# lang_ukrainian
source: 🇺🇦 Ukrainian
ru: 🇺🇦 Украинский
uk: 🇺🇦 Українська

# lang_russian
source: 🇷🇺 Russian
ru: 🇷🇺 Русский
uk: 🇷🇺 Російська

# recommendations_coming_soon
source: 💯 Smart suggestions are coming soon!
ru: 💯 Рекомендации скоро появятся!
uk: 💯 Рекомендації скоро з'являться!

# watch_history_coming_soon
source: 🧩 Your watch history will be here soon!
ru: 🧩 Ваша история просмотров скоро будет здесь!
uk: 🧩 Ваша історія переглядів скоро буде тут!

# favorites_coming_soon
source: ⭐ Your favorite movies will be stored here!
ru: ⭐ Ваши любимые фильмы будут сохранены здесь!
uk: ⭐ Ваші улюблені стрічки будуть збережені тут!

# download_coming_soon
source: 📥 Download Movie coming soon!
uk: 📥 Завантаження скоро з'явиться!

# network_error
source: 🌐 Network error. Please try again.
ru: 🌐 Ошибка сети. Попробуйте еще раз.
uk: 🌐 Помилка мережі. Спробуйте ще раз.

# backend_error
source: 🔧 Server error. Please try again later.
ru: 🔧 Ошибка сервера. Попробуйте еще раз.
uk: 🔧 Помилка сервера. Спробуйте ще раз.

# invalid_input
source: ⚠️ Invalid input. Please try again.
ru: ⚠️ Неправильный ввод. Попробуйте еще раз.
uk: ⚠️ Неправильний ввід. Спробуйте ще раз.

source: 👤 User not found.
ru: 👤 Пользователь не найден.
uk: 👤 Користувач не знайдений.

source: 🚫 Permission denied.
ru: 🚫 Доступ запрещен.
uk: 🚫 Доступ заборонений.

# name_too_long
source: ⚠️ Name is too long. Maximum 50 characters.
ru: ⚠️ Имя слишком длинное. Максимум 50 символов.
uk: ⚠️ Ім'я занадто довге. Максимум 50 символів.

# name_too_short
source: ⚠️ Name is too short. Minimum 2 characters.
ru: ⚠️ Пожалуйста, введите имя. Оно не может быть пустым.
uk: ⚠️ Будь ласка, введіть ім'я. Воно не може бути порожнім.

# invalid_name
source: ⚠️ Invalid name. Please use only letters and numbers.
ru: ⚠️ Неправильное имя. Используйте только буквы, цифры, пробелы и базовую пунктуацию (- _ .).
uk: ⚠️ Неправильне ім'я. Використовуйте тільки літери, цифри, пробіли та базову пунктуацію (- _ .).

source: 🎬 Movie found!
ru: 🎬 Фильм найден!
uk: 🎬 кіно знайдено!

# no_movies_found
source: 😔 No movies found. Try different search terms.
ru: 😔 Фильмы не найдены. Попробуйте другие поисковые термины.
uk: 😔 кіно не знайдено. Спробуйте інші пошукові терміни.

source: 📝 Movie Details
ru: 📝 Детали фильма
uk: 📝 Деталі кіно

# watch_movie
source: ▶️ Watch
ru: ▶️ Смотреть
uk: ▶️ Дивитися

# download_movie
source: 📥 Download
ru: 📥 Скачать
uk: 📥 Завантажити

source: ⭐ Add to Favorites
ru: ⭐ Добавить в избранное
uk: ⭐ Додати до улюблених

source: 💔 Remove from Favorites
ru: 💔 Удалить из избранного
uk: 💔 Видалити з улюблених

# genre_selection_prompt
source: 🎭 Choose one or more genres After selection, press ✅Confirm:
ru: 🎭 Выберите один или несколько жанров После нажмите ✅Подтвердить:
uk: 🎭 Оберіть один або декілька жанрів Потім натисніть ✅Підтвердити:

# year_range_selection_prompt
source: 📅 Now pick a year or range:
ru: 📅 Теперь выберите, фильмы за какой год или период вы хотите посмотреть:
uk: 📅 Тепер оберіть, кіно за який рік або період ви хочете переглянути:

# year_selection_prompt
source: 🗓️ Choose year(s). You can tap multiple to select a range:
ru: 🗓️ Выберите год(ы). Нажмите на несколько, чтобы выбрать диапазон:
uk: 🗓️ Оберіть рік(роки). Натисніть кілька, щоб обрати діапазон:

# no_matches_found_try_new_search
source: 😕 No matches found. Try a new search!
ru: 😕 Совпадений не найдено. Попробуйте новый поиск!
uk: 😕 Збігів не знайдено. Спробуйте новий пошук!

# fallback_menu_prompt
source: Use the menu below to find movies, get movie suggestions, or download movies 🎬👇
ru: Используйте меню ниже, чтобы найти, получить рекомендации или скачать фильм 🎬👇
uk: Скористайтеся меню нижче, щоб знайти, отримати пропозиції або завантажити кіно 🎬👇

# select_language_for_movies
source: 🌍 Select your preferred language for watching movies:
ru: 🌍 Выберите предпочитаемый язык для просмотра фильмов:
uk: 🌍 Оберіть бажану мову для перегляду кіно:

source: ❌ Error: Cannot show language options
ru: 😭 Ошибка: невозможно показать параметры языка
uk: 😭 Помилка: Не вдається відобразити мовні параметри

# language_updated_successfully
source: ✅ Language set to: {language} Press ▶️Watch or 💾Download — the movie will be in the selected language.
ru: ✅ Язык обновлен: {language} Нажмите «Смотреть» или «Скачать» — фильм будет на выбранном языке.
uk: ✅ Мову оновлено: {language} Натисніть «Дивитися» або «Завантажити» — кіно буде цією мовою.

# error_update_language_failed
source: ❌ Couldn't update language, please try later
ru: 😭 Не удалось обновить язык. Вы можете повторить попытку позже в настройках.
uk: 😭 Не вдалося оновити мову. Ви можете спробувати пізніше в налаштуваннях

# session_expired_restart_search
source: 😅 I already forgot what we were searching! Please start a new search 👇
ru: 😅 Я уже забыла, что мы искали! Пожалуйста, начните новый поиск 👇
uk: 😅 Я вже забув, що ми шукали! Будь ласка, почніть новий пошук 👇

# cast_crew_coming_soon
source: 🕵️ Real cast/crew coming soon!
ru: 🕵️ Скоро покажем актеров/съёмочную группу!
uk: 🕵️ Акторський склад/знімальна група скоро!

# trailer_coming_soon
source: ⬇️ Trailers coming soon!
ru: ⬇️ Скоро появятся трейлеры!
uk: ⬇️ Трейлери вже скоро!

# related_movies_coming_soon
source: 🎬 Related movies feature coming soon!
ru: 🎬 Скоро появятся похожие фильмы!
uk: 🎬 Незабаром з'явиться схоже кіно!

# favorites_storage_coming_soon
source: ⭐️ Favorites coming soon!
ru: ⭐️ Скоро будут избранные!
uk: ⭐️ Список улюбленого кіно вже скоро!

# watchlist_storage_coming_soon
source: 🕰️ Watch later coming soon!
ru: 🕰️ Сохранённые «на потом» — скоро!
uk: 🕰️ Переглянути пізніше, скоро!

# ratings_storage_coming_soon
source: 👍️ Movies you rated coming soon!
ru: 👍️ Фильмы, которые вы оценили, скоро!
uk: 👍️ Кіно, яке ви оцінили, скоро!

# yes_btn
source: ✅ Yes
ru: ✅ Да
uk: ✅ Так

# no_btn
source: ❌ No
ru: ❌ Нет
uk: ❌ Ні

# confirm_report_movie_not_found
source: Are you sure you want to report to admin that you cannot find this movie?
ru: Вы уверены, что хотите сообщить администратору, что не можете найти этот фильм?
uk: Ви впевнені, що хочете повідомити адміністратора, що не можете знайти це кіно?

# report_thanks_message
source: Thanks for your report, we will try to find this movie, so you can watch it later ❤️
ru: Спасибо за ваше сообщение, мы постараемся найти этот фильм, чтобы вы могли посмотреть его позже ❤️
uk: Дякуємо за ваше повідомлення, ми спробуємо знайти це кіно, щоб ви могли переглянути його пізніше ❤️

# end_onboarding_success
source: ✅ Perfect! Your preferences have been saved. 🎬 You are set to start finding amazing movies!
ru: ✅ Отлично! Ваши предпочтения сохранены. 🎬 Теперь вы можете начать находить потрясающие фильмы!️
uk: ✅ Чудово! Ваші налаштування збережено. 🎬 Час знаходити дивовижне кіно!️

# end_onboarding_fail
source: ❌ Sorry, there was an issue saving your preferences. You can try again later in settings.
ru: 😭 Извините, возникла проблема с сохранением ваших предпочтений. Вы можете повторить попытку позже в настройках.
uk: 😭 Вибачте, виникла проблема зі збереженням ваших вподобань. Ви можете спробувати пізніше в налаштуваннях.

# search_by_name_prompt
source: 🎬 I'm ready! Just type the name of the movie you're looking for 👇
ru: 🎬 Я готова! Просто введите название фильма, который вы ищете 👇
uk: 🎬 Я готова! Просто введіть назву кіно, котре ви шукаєте 👇

# no_search_results_try_again
source: 🧐 Hmm, I couldn't find anything matching. Try searching for something else👇 Or press Back to return.
ru: 🧐 Хм, я не смогла найти ничего подходящего. Попробуйте поискать что-нибудь другое👇 Или нажмите «Назад», чтобы вернуться.
uk: 🧐 Хм, я не знайшла нічого відповідного. Спробуйте пошукати щось інше👇 Або натисніть "Назад", щоб повернутися.

# movie_link_no_longer_valid
source: ❌ This movie link is no longer valid. Please re-search from the main menu.
ru: 🫠 Эта ссылка на фильм больше недействительна. Пожалуйста, повторите поиск из главного меню.
uk: 🫠 Це посилання на кіно більше не дійсне. Будь ласка, повторіть пошук у головному меню.

# lost_movie_data_research
source: I lost the movie somewhere along the way😭 Please re-search from the main menu.
ru: Я потеряла фильм по пути😭 Пожалуйста, повторите поиск из главного меню.
uk: Я загубила кіно по дорозі😭 Будь ласка, пошукайте ще раз з головного меню.

# preparing_movie_dubs_watch
source: 🎬 Preparing all available dubs for selected movie... You will watch in 1-2 minutes ❤️
ru: 🎬 Готовлю все доступные дубляжи для выбранного фильма... Вы сможете смотреть через 1-2 минуты ❤️
uk: 🎬 Шукаю всі доступні дубляжі для обраного кіно... Ви зможете переглянути його за 1-2 хвилини ❤️

# sorry_couldnt_extract_movie_try_again
source: 😭 Sorry, I couldn't extract the movie. Please try again.
ru: 😭 Извините, мне не удалось извлечь фильм. Попробуйте еще раз, пожалуйста.
uk: 😭 Вибачте, мені не вдалося видобути кіно Спробуйте ще раз, будь ласка.

# start_watching_btn
source: ▶️ Start watching
ru: ▶️Начать просмотр
uk: ▶️Почніть перегляд

# movie_ready_to_watch
source: 🎬 Your {movie_title} is ready:
ru: 🎬 Ваш {movie_title} готов:
uk: 🎬 Ваш {movie_title} готовий:

# text_dubs_ready_to_download
source: {emoji} {display_dub} dub
ru: {emoji} {display_dub} дубляж
uk: {emoji} {display_dub} дубляж

# download_another_dub
source: 📥 Download with another dub
ru: 📥 Скачать с другим дубляжом
uk: 📥 Завантажити з іншим дубляжем

# already_have_movie
source: 🎉 We already have this movie! Choose an option:
ru: 🎉 У нас уже есть этот фильм! Выберите вариант:
uk: 🎉 У нас вже є це кіно! Виберіть варіант:

source: 📥 Choose dub to download
ru: 📥 Выберите дубляж для скачивания
uk: 📥 Оберіть дубляж для завантаження

# movie_never_downloaded_before
source: {title} was never downloaded before! Be the first:
ru: {title} никогда не скачивался ранее! Будьте первым:
uk: {title} раніше ніколи не завантажувався! Будьте першим:

source: 🔍 Checking downloaded versions & dubs...
ru: 🔍 Проверяю скачанные версии и дубляжи...
uk: 🔍 Перевіряю завантажені версії та дубляжі...

# try_searching_from_beginning
source: ☹️ Try searching for the movie from the beginning please, or watch online. I will fix this 🥰
ru: ☹️ Попробуйте поискать фильм с самого начала, пожалуйста, или смотрите онлайн. Позже исправлю 🥰
uk: ☹️ Спробуйте пошукати кіно спочатку, будь ласка, або дивіться онлайн. Пізніше я це виправлю 🥰

# no_dubs_available_in_language
source: 😢 No dubs available in your language for this movie, I am sorry! I will try to find this content and upload it 😇
ru: 😢 Нет доступных дубляжей на вашем языке для этого фильма, извините! Я попробую найти и загрузить позже 😇
uk: 😢 Немає доступних дубляжів вашою мовою для цього кіно, вибачте! Ми спробуємо знайти цей контент та завантажити його 😇

source: ✅ Download default dub
ru: ✅ Скачать дубляж
uk: ✅ Завантажити стандартний дубляж

# movie_has_only_default_dub
source: 🎙 This movie has only one default dub:
ru: 🎙 У этого фильма только один дубляж:
uk: 🎙 У цього кіно лише один дубляж:

source: 📁 Already available dubs:
ru: 📁 Уже доступные дубляжи:
uk: 📁 Вже доступні дубляжі:

source: 📥 Available to download:
ru: 📥 Доступно для скачивания:
uk: 📥 Доступно для завантаження:

# choose_dub_to_download_or_watch
source: 🎙 Choose a dub to download (or fast watch one we already have in Delivery Bot):
ru: 🎙 Выберите дубляж для скачивания (или сразу смотрите тот, что у меня уже есть):
uk: 🎙 Оберіть дубляж для завантаження (або відразу дивіться той, що у мене вже є):

# movie_ready_to_watch_delivery
source: 🎬 Your {movie_title} is ready to watch!
ru: 🎬 Ваш {movie_title} готов к просмотру!
uk: 🎬 Ваш {movie_title} готовий до перегляду!

source: 🎁 Get movie from Delivery Bot
ru: 🎁 Получить фильм от Бота-Курьера
uk: 🎁 Отримати кіно від Бота-Кур'єра

# dub_selection_expired
source: 😖 This dub selection expired. Please start again from the beginning 🤗
ru: 😖 Время на выбор дубляжа истекло. Пожалуйста, начните сначала 🤗
uk: 😖 Час на вибір дубляжу минув. Будь ласка, почніть спочатку 🤗

# could_not_process_dub_info
source: 🤯 Could not process dub info, sorry! Please start again from the beginning 🤗
ru: 🤯 Не смогла обработать информацию о дубляже, извините! Пожалуйста, начните сначала 🤗
uk: 🤯 Не вдалося обробити інформацію про дубляж, вибачте! Будь ласка, почніть спочатку 🤗

# added_to_download_queue
source: 🫡 I have added you to the queue for download... This may take 5–10 minutes 😉
ru: 🫡 Я добавила вас в очередь на скачивание... Это может занять 5–10 минут 😉
uk: 🫡 Я додала вас до черги на завантаження... Це може зайняти 5–10 хвилин 😉

# failed_to_trigger_download
source: 😖 Failed to trigger download, sorry! Please start again from the beginning 🤗
ru: 😖 Не смогла запустить скачивание, извините! Пожалуйста, начните сначала 🤗
uk: 😖 Не вдалося запустити завантаження, вибачте! Будь ласка, почніть спочатку 🤗

# movie_ready_start_delivery_bot
source: 🎬 Your {movie_title} is ready! 📦 To receive it, start the delivery bot👇
ru: 🎬 Ваш {movie_title} готов! 📦 Чтобы получить его, запустите Бота-Курьера👇
uk: 🎬 Ваш {movie_title} готовий! 📦 Щоб отримати його, запустіть Бота-Кур'єра👇

source: 🎁 Open Delivery Bot
ru: 🎁 Открыть Бота-Курьера
uk: 🎁 Відкрити Бота-Кур'єра

# unexpected_error_during_download
source: 🤯 Unexpected error during download. Please start again from the beginning 🤗
ru: 🤯 Неожиданная ошибка во время скачивания. Пожалуйста, начните сначала 🤗
uk: 🤯 Несподівана помилка під час завантаження. Будь ласка, почніть спочатку 🤗

# download_limit
source: 😮 You are already downloading the maximum number of movies allowed at once ({user_limit}). Please wait for your current download(s) to finish and then download another video 🥰
ru: 😮 Вы уже скачиваете максимальное количество фильмов одновременно - ({user_limit}). Пожалуйста, дождитесь завершения текущих загрузок, а затем скачайте другое видео 🥰
uk: 😮 Ви вже завантажуєте максимальну кількість кіно одночасно - ({user_limit}). Будь ласка, зачекайте, поки поточні завантаження завершаться, а потім завантажте інше відео 🥰

# duplicate_download
source: 🎬 You're already downloading this movie in this dub. Please wait for it to finish and you will enjoy your content 🥰
ru: 🎬 Вы уже скачиваете этот фильм с этим дубляжом. Пожалуйста, дождитесь завершения, и вы насладитесь контентом 🥰
uk: 🎬 Ви вже завантажуєте це кіно з цим дубляжем. Будь ласка, зачекайте, поки він завантажиться, і ви насолодитеся контентом 🥰

# wait_cards_updating
source: Please wait, some cards are still updating 🥰
ru: Пожалуйста, подождите, некоторые карточки еще обновляются 🥰
uk: Будь ласка, зачекайте, деякі картки ще оновлюються 🥰

# no_more_mirror_results_try_another_movie
source: 🥲 No more results found on mirrors. Try another movie.
ru: 🥲 Больше результатов не найдено. Попробуйте другой фильм
uk: 🥲 Більше результатів не знайшла. Спробуйте інше кіно.

# something_went_wrong_try_main_menu
source: 😔 Something went wrong. Please, try again from the main menu
ru: 😔 Что-то пошло не так. Пожалуйста, попробуйте еще раз из главного меню
uk: 😔 Щось пішло не так. Будь ласка, спробуйте ще раз з головного меню

# searching_in_progress
source: ⏳ Searching...
ru: ⏳ Ищу...
uk: ⏳ Шукаю...

# failed_to_search_mirrors_try_again
source: 😖 Failed to search mirrors. Please, try again from the beginning 🤗
ru: 😖 Поиск на удался. Пожалуйста, попробуйте еще раз с начала 🤗
uk: 😖 Не вдався пошук. Будь ласка, спробуйте ще раз спочатку 🤗

# unexpected_error_mirror_search_try_again
source: 🥲 Unexpected error during mirror search. Please, try again from the beginning 🤗
ru: 🥲 Неожиданная ошибка во время поиска зеркал. Пожалуйста, попробуйте еще раз с начала 🤗
uk: 🥲 Несподівана помилка під час пошуку. Будь ласка, спробуйте ще раз спочатку 🤗

# no_mirror_results_try_another_movie
source: 😔 No results found. Try another movie 🥰
ru: 😔 Результатов не найдено. Попробуйте другой фильм 🥰
uk: 😔 Результатів не знайдено. Спробуйте інше кіно 🥰

# only_one_dub
source: 🥲 Only 1 dub found
ru: 🥲 Найден только 1 дубляж
uk: 🥲 Знайдено лише 1 дубляж

# no_dubs_for_lang
source: 🥲 No available dubs found for selected language
ru: 🥲 Не найдено доступных дубляжей для выбранного языка
uk: 🥲 Не знайдено доступних дубляжів для обраної мови

# no_ua_dubs
source: 🎙️ Sorry, no Ukrainian dubs available for this movie
ru: 🎙️ Извините, украинские дубляжи для этого фильма недоступны
uk: 🎙️ Вибачте, українські дубляжі для цього кіно недоступні

source: Preferred language to watch:
ru: Предпочитаемый язык для просмотра:
uk: Бажана мова для перегляду:

# change_language_btn
source: 🌍 Change language
ru: 🌍 Изменить язык
uk: 🌍 Змінити мову

# wrong_movie_btn
source: ❌ Wrong movie
ru: ❌ Не тот фильм
uk: ❌ Не те кіно

# no_title_fallback
source: 🤯 No Title
ru: 🤯 Нет названия
uk: 🤯 Немає назви

# default_overview_fallback
source: This is a default overview for some movies. Probably good movie 🫡
ru: Это стандартное описание для некоторых фильмов. Вероятно, хороший фильм 🫡
uk: Це стандартний опис для деяких фільмів. Ймовірно, хороше кіно 🫡

# good_movie_fallback
source: Good movie 🫡
ru: Хороший фильм 🫡
uk: Хороше кіно 🫡

# select_btn
source: ✅ Select
ru: ✅ Выбрать
uk: ✅ Обрати

# collapse_card_btn
source: 🔼 Collapse card
ru: 🔼 Свернуть карточку
uk: 🔼 Згорнути картку

# expand_card_btn
source: ⬇️ Expand
ru: ⬇️ Развернуть
uk: ⬇️ Розгорнути

# scroll_down_hint
source: 👇 Scroll down to see all {batch_size} movies!
ru: 👇 Прокрутите вниз, чтобы увидеть все {batch_size}!
uk: 👇 Прокрутіть вниз, щоб побачити всі {batch_size}!

# press_next_hint
source: ➡️ Press 'Next' to see more movies!
ru: ➡️ Нажмите 'Далее', чтобы увидеть больше фильмов!
uk: ➡️ Натисніть 'Далі', щоб побачити більше кіно!

# scroll_up_hint
source: 👆 Scroll up to see all {batch_size} movies!
ru: 👆 Прокрутите вверх, чтобы увидеть все {batch_size}!
uk: 👆 Прокрутіть вгору, щоб побачити всі {batch_size}!

# exploring_movies_default
source: 🔎 You're exploring movies...
ru: 🔎 Вы изучаете фильмы...
uk: 🔎 Ви досліджуєте кіно...

# showing_movies_range
source: 🎬 Showing movies {global_start}–{global_end} of {total_results}
ru: 🎬 Показаны фильмы {global_start}–{global_end} из {total_results}
uk: 🎬 Показано кіно {global_start}–{global_end} з {total_results}

# previous_movies_btn
source: ⬅️ {batch_size} Previous Movies
ru: ⬅️ {batch_size} предыдущих
uk: ⬅️ {batch_size} попередніх

# next_movies_btn
source: ➡️ {batch_size} Next Movies
ru: ➡️ {batch_size} следующих
uk: ➡️ {batch_size} наступних

# can_not_find_btn
source: ❌ Can not find
ru: ❌ Не могу найти
uk: ❌ Не можу знайти

# watch_later_btn
source: 🕓 Watch Later
ru: 🕓 Посмотреть позже
uk: 🕓 Переглянути пізніше

# mirror_selection_hint
source: Click ➡ Next if you don't see '{movie_title}'
ru: Нажмите ➡ Далее, если не видите '{movie_title}'
uk: Натисніть ➡ Далі, якщо не бачите '{movie_title}'

# mirror_select_title
source: 🎬 Select '{movie_title}' and start watching
ru: 🎬 Выберите '{movie_title}' и начните просмотр
uk: 🎬 Оберіть '{movie_title}' і почніть перегляд

# previous_btn
source: ⬅ Previous
ru: ⬅ Предыдущий
uk: ⬅ Попереднє

# next_btn
source: ➡ Next
ru: ➡ Следующий
uk: ➡ Наступне

# confirm_btn
source: ✅ Confirm
ru: ✅ Подтвердить
uk: ✅ Підтвердити

# genre_action
source: 🔫 Action
ru: 🔫 Боевик
uk: 🔫 Бойовик

# genre_comedy
source: 😂 Comedy
ru: 😂 Комедия
uk: 😂 Комедія

# genre_adventure
source: 😎 Adventure
ru: 😎 Приключения
uk: 😎 Пригоди

# genre_thriller
source: 🤯 Thriller
ru: 🤯 Триллер
uk: 🤯 Трилер

# genre_romance
source: ❤️ Romance
ru: ❤️ Романтика
uk: ❤️ Романтика

# genre_drama
source: 😭 Drama
ru: 😭 Драма
uk: 😭 Драма

# genre_fantasy
source: 🧙 Fantasy
ru: 🧙 Фэнтези
uk: 🧙 Фентезі

# genre_mystery
source: 😱 Mystery
ru: 😱 Мистика
uk: 😱 Містика

# genre_family
source: 🤗 Family
ru: 🤗 Семейный
uk: 🤗 Сімейний

# genre_animation
source: 🌞 Animation
ru: 🌞 Анимация
uk: 🌞 Анімація

# genre_crime
source: 🕵️ Crime
ru: 🕵️ Криминал
uk: 🕵️ Кримінал

# genre_documentary
source: 📚 Documentary
ru: 📚 Документальный
uk: 📚 Документальний

# genre_history
source: 🏰 History
ru: 🏰 Исторический
uk: 🏰 Історичний

# genre_horror
source: 👻 Horror
ru: 👻 Ужасы
uk: 👻 Жахи

# genre_scifi
source: 🚀 Sci-Fi
ru: 🚀 Фантастика
uk: 🚀 Фантастика

# genre_war
source: ⚔️ War
ru: ⚔️ Военный
uk: ⚔️ Військовий

# genre_tv_movie
source: 📺 TV Movie
ru: 📺 ТВ фильм
uk: 📺 ТВ фільм

# genre_music
source: 🎵 Music
ru: 🎵 Музыкальный
uk: 🎵 Музичний
